/*************************************************************************
	 函数编程题：
     编写一个函数，功能是求整形参数二进制数中 1的个数和0的个数分别是多少？
     即:所求的数来自于主函数所传递的传参;
	> 创建时间: 2017年07月26日 星期三 20时52分13秒
 ************************************************************************/

#include<stdio.h>
void function(int num)
{
    int sum_1=0;
    int sum_0=0;
    if(num>=0)
    {
        while(num) 
        {
            if(0==num%2)
            {
                sum_0++;
            }
            else
            {
                sum_1++;
            }
            num/=2;
        }
    }
    else
    {
        printf("输入不合法\n");
    }
    printf("sum_1:%d\nsum_0:%d\n",sum_1,sum_0);
    return ;
}
int main()
{
    int num;
    scanf("%d",&num);
    function(num);
    return 0;
}
/*************************************************************************
	> 文件名: test1.c
	> 作者:张鹏 
	> 邮箱:1365385081@qq.com 
	> 创建时间: 2017年07月26日 星期三 20时38分52秒
 ************************************************************************/

#include<stdio.h>
int b;
int a=10;
void function(int x,int y)
{
    int i=0;
    static int call_times=0;

    for(i=0;i<x;i++)
    {
        printf("#");
    }
    putchar('\n');
    printf("**************%d\n",call_times++);
}
int main()
{
    printf("a:%d\n",a);
    printf("b:%d\n",b);
    while(b<10)
    {
        function(a,b);
        b++;
    }
    return 0;
}
/*************************************************************************
	> 文件名: test2.c
	> 作者:张鹏 
	> 邮箱:1365385081@qq.com 
	> 创建时间: 2017年07月26日 星期三 21时43分29秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    char p[4][10]={"123456","asdfgh","qwerty","i am ok"};
    char *p2[4]={NULL};
    int i=0;
    while(i<4)
    {
        p2[i]=*(p+i);
        printf("%p\t%p\n",p2+i,p+i);
        printf("%s\n",p2[i]);
        i++;
    }

    return 0;
}
/********************************************
打印结果：
    0x7ffed49182b0	0x7ffed49182d0
    123456
    0x7ffed49182b8	0x7ffed49182da
    asdfgh
    0x7ffed49182c0	0x7ffed49182e4
    qwerty
    0x7ffed49182c8	0x7ffed49182ee
    i am ok
结果分析：
    char p[4][10]是一个二维数组，其数组元素是一个一维数组（元素个数为10）。
    char *p2[4]是一个指针数组，数组元素为4个指向char*类型的指针。
**********************************************/
