1:测试、观察printf的返回值



2:编写一个指针函数，把整数123转化成字符串”123”
	要求：函数名 int_to_str
		  参数	 来自主函数的scanf接收的整数
		  返回值 转换后的字符串(思考存储类型)
3：编写函数判断一个字符串是否为回文字符串。
	level
	Yes
	12345
	No
要求：	函数名：	if_plalindrome
		参数：		输入的字符串
		返回值：	如果是回文数，返回0；
					如果不是，返回-1；
					
		区分大小写，Level不是回文数；
					

选作；
1从键盘输入一个字符串，通过函数实现：
	按照字符顺序从小到大进行排序，
	并要求删除重复的字符。如输入”ad2f3adjfeainzzzv”，则输出”23adefijnvz”。


2编写函数insert(char *s1,char *s2,int pos)，实现在字符串s1中的指定位置pos处插入字符串s2


3编写程序，实现下面一个有关单词个数统计问题。编写一个函数findstr(char *str,char *substr)，
	该函数统计一个长度为2的子字符串在另一个字符串中出现的次数。例如，假定输入的字符串为
	”asd asasdfg asd as zx67 asd mklo”，子字符串为as，函数返回值是6

4有n个人围成一个圆圈，顺序排号，从第一个人开始报数(从1到3报数)，凡
	报到3的人退出圈子，问最后留下的是原来的第几号？
t

