1用循环打印出下列图形
F
FE
FED
FEDC
FEDCB
FEDCBA

完成4-----选择结构程序设计的pc上机题

完成5-----循环程序设计上面的 1 、5题




选作：
根据昨天的第一题，制作一个登陆界面，要求的功能是

（1）打印以下提示信息

	“如果输入 ‘1’，则进入注册模式；”
	“如果输入 ‘2’  则进入登录模式；”
	“如果输入 ‘3’  则退出；”

（2）选择模式
	接收用户输入；
	如果输入 ‘1’，则进入注册模式，其功能是接收两个正整数，数据位数都尽量不超过6位；分别作为
								  用户名和密码，并提示“注册成功”，打印提示信息并进入选择模式；
	如果输入 ‘2’  则进入登录模式；接收用户输入两个正整数，如果输入的是默认用户名、密码（1234、1234），
								  则提示Welcom！！ ，并退出程序。否则打印提示信息，重新进入选择模式；
	如果输入 ‘3’  则提示“退出”，并退出程序；
	
	对于选择模式下输入‘2’后，如果之前已经在 ‘注册模式’进行成功注册，则可选择用已经组册的用户名、密码登录，成功则提示Welcom，否则打印提示信息，重新进入选择模式）

2输出10000内的完备数，

	数组比较简单，
	




