
								复习数组的定义及初始化完成以下题目；


从键盘输入10个任意字符，输出其平均ascii值；


设计一个猜字母游戏，让用户输入一个字母(区分大小写)，
	如果输入的字符是预先设定好的字母，则提示welcom，否则提示继续输入；
	如果连续输入的次数超过10次，则提示此字符并退出；
	任意时候输入字符'!'感叹号则提示预先设定好的字母并退出；

输入一个字符串和一个字符，删除字符串中后面的字符对应的元素并输出结果；例如（输入“123456asdfgh” 和‘a’，则输出123456sdfgh，字符在字符串中要存在）
（提示，可以用一个备用字符串临时存储被修改后的数据）


输入一个含有大写、小写字母和阿拉伯数字的字符串，将其中的大写字母转换成小写字母，小写字母转换成大写，阿拉伯字符则加一（0->1、1->2、2->3...9->0），输出结果
（提示：直接计算结果并输出）

输入一个正整数数，打印出其对应的原码、反码；(除2倒取余，数组存储其1/0)



假设《我是歌手》节目组一共四位评委，现给一歌手评分（也就是输入4个数），分数范围0~10；试统计出此人得分平均数；


输入一个字符串，不使用strlen函数，不使用scanf的返回值(注意：不是说不调用scanf)，统计此字符串的长度；(这里可能要使用 '\0'作为判断依据)；

输入一个6位的整数，将其每一位转换成对应的字符，再把字符值加一，将此字符逆序输出（如输入整数１２３４５６.输出７６５４３２，设９加一变成０）；

已知反字母表的加密算法的加密方式是：a<->z  b<->y .... Z<->A   大小写一致，阿拉伯数字 1<->9 2<->8 .... 5<->0
	例如 i love you2 加密后变成 r olev blf8
	根据此算法，从键盘输入任意英文，打印出加密后的语句。




选作

今发起投票公选班委，四人参加选举，假设一共30人参与投票（含被选举者本人），统计每人得票票数。

英雄联盟中寒冰看见对面开始使用回城技能准备回城，已知回程时间8秒，
	(1)假设寒冰此刻位置距离对面水泉6000码，寒冰的终极技能魔法水晶剑移动速度每秒1600码，试着计算多久后向对面释放终极技能可以命中目标。
	(2)现由于时间计算不足导致技能在命中目标后目标未死亡，已知技能对目标的晕眩时间计算公式为：技能移动距离/3200+ 2 秒,计算目标的晕眩时间


输入一个长的字符串和一个短的字符串，删除长得字符串中对应短字符串的的部分并退出；

完善登录注册，将用户名和密码改为字符串

某字符串为1111110001100，统计后变为字符串61302120，观察二者规律，写出	
	11110000000000000000000000111101010101111111111111110 统计出来的数据（已知同一字符连续出现的数量不超过15）

完成４００道题里面的任意５道编程题
